# vim:ft=ruby

if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"
    tap "koekeishiya/formulae"

    brew "noti" # utility to display notifications from scripts
    brew "trash" # rm, but put in the trash rather than completely delete

    # Applications
    cask "imageoptim" # a tool to optimize images
    cask "1password/tap/1password-cli"

    # yabai
    brew "yabai"
    brew "skhd"

    brew "pngpaste"

    # Fonts
    cask "font-fira-code"
    cask "font-jetbrains-mono"
    cask "font-cascadia-mono"
    cask "font-symbols-only-nerd-font"
    cask "font-recursive-code"
    cask "font-monaspace"
elsif OS.linux?
    brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
end

tap "homebrew/bundle"
tap "homebrew/core"

tap "suzuki-shunsuke/tfcmt"
tap "suzuki-shunsuke/tfprovidercheck"

tap "aquaproj/aqua"
tap "aquasecurity/trivy"

tap "hashicorp/tap"

tap "sdkman/tap"

tap "helm/tap"

# packages
brew "bat" # better cat
brew "cloc" # lines of code counter
brew "entr" # file watcher / command runner
brew "exa" # ls alternative
brew "fd" # find alternative
brew "fnm" # Fast Node version manager
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "gh" # GitHub CLI
brew "git" # Git version control (latest version)
brew "git-delta" # a better git diff
brew "glow" # markdown viewer
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "highlight" # code syntax highlighting
brew "htop" # a top alternative
brew "jq" # work with JSON files in shell scripts
brew "lazygit" # a better git UI
brew "neofetch" # pretty system info
brew "neovim" # A better vim
brew "python" # python (latest)
brew "ripgrep" # very fast file searcher
brew "shellcheck" # diagnostics for shell sripts
brew "tmux" # terminal multiplexer
brew "tree" # pretty-print directory contents
brew "vim" # Vim (latest)
brew "wdiff" # word differences in text files
brew "wget" # internet file retriever
brew "z" # switch between most used directories
brew "zoxide" # switch between most used directories
brew "zsh" # zsh (latest)
brew "zk"

brew "tfenv" # Terraform version manager. TFENV_ARCH=amd64 tfenv install 1.3.3 
brew "terraform-docs"

brew "bazelisk" # A user-friendly launcher for Bazel.
brew "sdkman-cli"

brew "snyk"
brew "ngrok"


brew "chruby" 
brew "ruby-install"

brew "xz"

# k8s
brew "kind"
brew "krew"
brew "kubebuilder"

brew "act" # Run your GitHub Actions locally!

#Open Policy Agent
brew "opa"
brew "conftest"
